animals-api/app/controllers/api/v1/animals_controller.rb

SELECT "animals".* FROM "animals"
---
  def index
    animals = Animal.all

SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def show
    animal = Animal.find_by(id:params[:id])