animals-api/app/controllers/api/v1/states_controller.rb

SELECT "states".* FROM "states"
---
  def index
    states =  State.all