animals-api/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("first", "last", "state", "username", "password_digest", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
  user = User.new(username: params[:username],
  password: params[:password],
  first: params[:first],
  last: params[:last],
  state: params[:state],
  bio: params[:bio]

  )
  if user.save